app/Controllers/Pengguna.php

SELECT *
FROM `pengguna`
---
    public function index()
    {
        $builder = $this->db->table('pengguna');
        $query   = $builder->get();