app/Controllers/UP3.php

  public function datava()
  {
    if ($_SERVER['REQUEST_METHOD'] == 'POST') {
      $selectedMonth = $this->request->getVar('selectedMonth');
      $selectedMonth = date('m', strtotime($selectedMonth));
    } else {
      $selectedMonth = date('m');
    }

    $bulan = array(1 => 'Januari', 'Februari', 'Maret', 'April', 'Mei', 'Juni', 'Juli', 'Agustus', 'September', 'Oktober', 'November', 'Desember');
    $namaBulan = $bulan[(int)$selectedMonth];
    $yearf = $this->request->getVar('tahun') ?? date('Y');

    $va = $this->vaGtlo
      ->join('klasifikasi', 'kategori.klasifikasi_id = klasifikasi.klasifikasi_id')
      ->join('jenis', 'klasifikasi.data_id = jenis.data_id')
      ->join('cabang', 'jenis.cabang_id = cabang.cabang_id')
      ->where('jenis.data_id', '2')
      ->where('YEAR(kategori.bulan)', $yearf)
      ->orderBy('bulan')
      ->findAll();


    $vaFilter = $this->vaGtlo
      ->select('bulan, klasifikasi_id, SUM(tarif_s) as tarif_s, SUM(tarif_r) as tarif_r, SUM(tarif_b) as tarif_b, SUM(tarif_i) as tarif_i, SUM(tarif_p) as tarif_p')
      ->where('MONTH(kategori.bulan)', $selectedMonth)
      ->whereIn('klasifikasi_id', ['3', '4']) // Menyaring berdasarkan klasifikasi_id 1 dan 2
      ->where('YEAR(kategori.bulan)', $yearf)
      ->groupBy(['bulan', 'klasifikasi_id'])
      ->orderBy('bulan', 'DESC')
      ->limit(2)
      ->find();
---
SELECT *
FROM `kategori`
JOIN `klasifikasi` ON `kategori`.`klasifikasi_id` = `klasifikasi`.`klasifikasi_id`
JOIN `jenis` ON `klasifikasi`.`data_id` = `jenis`.`data_id`
JOIN `cabang` ON `jenis`.`cabang_id` = `cabang`.`cabang_id`
WHERE `jenis`.`data_id` = '2'
AND YEAR(kategori.bulan) = '2025'
ORDER BY `bulan`
SELECT `bulan`, `klasifikasi_id`, SUM(tarif_s) as tarif_s, SUM(tarif_r) as tarif_r, SUM(tarif_b) as tarif_b, SUM(tarif_i) as tarif_i, SUM(tarif_p) as tarif_p
FROM `kategori`
WHERE MONTH(kategori.bulan) = '03'
AND `klasifikasi_id` IN ('3','4')
AND YEAR(kategori.bulan) = '2025'
GROUP BY `bulan`, `klasifikasi_id`
ORDER BY `bulan` DESC
 LIMIT 2

  public function datakwh()
  {
    $yearf = $this->request->getVar('tahun') ?? date('Y');
    // $selectedMonth = $this->request->getVar('bulan') ?? date('m');
    if ($_SERVER['REQUEST_METHOD'] == 'POST') {
      $selectedMonth = $this->request->getVar('selectedMonth');
      $selectedMonth = date('m', strtotime($selectedMonth));
    } else {
      $selectedMonth = date('m');
    }

    $bulan = array(1 => 'Januari', 'Februari', 'Maret', 'April', 'Mei', 'Juni', 'Juli', 'Agustus', 'September', 'Oktober', 'November', 'Desember');
    $namaBulan = $bulan[(int)$selectedMonth];

    $kwh = $this->kwhGtlo
      ->join('klasifikasi', 'kategori.klasifikasi_id = klasifikasi.klasifikasi_id')
      ->join('jenis', 'klasifikasi.data_id = jenis.data_id')
      ->join('cabang', 'jenis.cabang_id = cabang.cabang_id')
      ->where('jenis.data_id', '3')
      ->where('YEAR(kategori.bulan)', $yearf)
      ->orderBy('bulan')
      ->findAll();

    $query2 = $this->kwhGtlo
      ->select('bulan, klasifikasi_id, SUM(tarif_s) as total_tarif_s, SUM(tarif_r) as total_tarif_r, SUM(tarif_b) as total_tarif_b, SUM(tarif_i) as total_tarif_i, SUM(tarif_p) as total_tarif_p')
      ->whereIn('klasifikasi_id', ['5', '6']) // Menyaring berdasarkan klasifikasi_id 1 dan 2
      // ->where('YEAR(kategori.bulan)', $yearf)
      ->groupBy(['bulan', 'klasifikasi_id'])
      // ->limit(2)
      ->find();
---
SELECT *
FROM `kategori`
JOIN `klasifikasi` ON `kategori`.`klasifikasi_id` = `klasifikasi`.`klasifikasi_id`
JOIN `jenis` ON `klasifikasi`.`data_id` = `jenis`.`data_id`
JOIN `cabang` ON `jenis`.`cabang_id` = `cabang`.`cabang_id`
WHERE `jenis`.`data_id` = '3'
AND YEAR(kategori.bulan) = '2025'
ORDER BY `bulan`
SELECT `bulan`, `klasifikasi_id`, SUM(tarif_s) as total_tarif_s, SUM(tarif_r) as total_tarif_r, SUM(tarif_b) as total_tarif_b, SUM(tarif_i) as total_tarif_i, SUM(tarif_p) as total_tarif_p
FROM `kategori`
WHERE `klasifikasi_id` IN ('5','6')
GROUP BY `bulan`, `klasifikasi_id`